Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SYSCON4.h
/*
** ###################################################################
**     Processors:          MIMXRT735SGAWBR_cm33_core0
**                          MIMXRT735SGAWBR_cm33_core1
**                          MIMXRT735SGAWBR_ezhv
**                          MIMXRT735SGAWBR_hifi1
**                          MIMXRT735SGFOB_cm33_core0
**                          MIMXRT735SGFOB_cm33_core1
**                          MIMXRT735SGFOB_ezhv
**                          MIMXRT735SGFOB_hifi1
**                          MIMXRT758SGAWBR_cm33_core0
**                          MIMXRT758SGAWBR_cm33_core1
**                          MIMXRT758SGAWBR_ezhv
**                          MIMXRT758SGAWBR_hifi1
**                          MIMXRT758SGFOB_cm33_core0
**                          MIMXRT758SGFOB_cm33_core1
**                          MIMXRT758SGFOB_ezhv
**                          MIMXRT758SGFOB_hifi1
**                          MIMXRT798SGAWBR_cm33_core0
**                          MIMXRT798SGAWBR_cm33_core1
**                          MIMXRT798SGAWBR_ezhv
**                          MIMXRT798SGAWBR_hifi1
**                          MIMXRT798SGAWBR_hifi4
**                          MIMXRT798SGFOB_cm33_core0
**                          MIMXRT798SGFOB_cm33_core1
**                          MIMXRT798SGFOB_ezhv
**                          MIMXRT798SGFOB_hifi1
**                          MIMXRT798SGFOB_hifi4
**
**     Version:             rev. 4.0, 2025-06-06
**     Build:               b250606
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SYSCON4
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-06-06)
**         B0 initial version
**
** ###################################################################
*/

/*!
 * @file PERI_SYSCON4.h
 * @version 4.0
 * @date 2025-06-06
 * @brief CMSIS Peripheral Access Layer for SYSCON4
 *
 * CMSIS Peripheral Access Layer for SYSCON4
 */

#if !defined(PERI_SYSCON4_H_)
#define PERI_SYSCON4_H_                          /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT735SGAWBR_cm33_core0) || defined(CPU_MIMXRT735SGFOB_cm33_core0))
#include "MIMXRT735S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_cm33_core1) || defined(CPU_MIMXRT735SGFOB_cm33_core1))
#include "MIMXRT735S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_ezhv) || defined(CPU_MIMXRT735SGFOB_ezhv))
#include "MIMXRT735S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_hifi1) || defined(CPU_MIMXRT735SGFOB_hifi1))
#include "MIMXRT735S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_cm33_core0) || defined(CPU_MIMXRT758SGFOB_cm33_core0))
#include "MIMXRT758S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_cm33_core1) || defined(CPU_MIMXRT758SGFOB_cm33_core1))
#include "MIMXRT758S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_ezhv) || defined(CPU_MIMXRT758SGFOB_ezhv))
#include "MIMXRT758S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_hifi1) || defined(CPU_MIMXRT758SGFOB_hifi1))
#include "MIMXRT758S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_cm33_core0) || defined(CPU_MIMXRT798SGFOB_cm33_core0))
#include "MIMXRT798S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_cm33_core1) || defined(CPU_MIMXRT798SGFOB_cm33_core1))
#include "MIMXRT798S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_ezhv) || defined(CPU_MIMXRT798SGFOB_ezhv))
#include "MIMXRT798S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_hifi1) || defined(CPU_MIMXRT798SGFOB_hifi1))
#include "MIMXRT798S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_hifi4) || defined(CPU_MIMXRT798SGFOB_hifi4))
#include "MIMXRT798S_hifi4_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__XTENSA__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SYSCON4 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON4_Peripheral_Access_Layer SYSCON4 Peripheral Access Layer
 * @{
 */

/** SYSCON4 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[40];
  __IO uint32_t MMU2_MEM_CTRL;                     /**< MMU2 Memory Control, offset: 0x28 */
  __IO uint32_t XSPI2_MEM_CTRL;                    /**< XSPI2 Memory Control, offset: 0x2C */
  __IO uint32_t EZHV_MEM_CTRL;                     /**< EZH-V Memory Control, offset: 0x30 */
  __IO uint32_t LCDIF_MEM_CTRL;                    /**< LCDIF Memory Control, offset: 0x34 */
       uint8_t RESERVED_1[4];
  __IO uint32_t JPEGDEC_MEM_CTRL;                  /**< JPEGDEC Memory Control, offset: 0x3C */
  __IO uint32_t PNGDEC_MEM_CTRL;                   /**< PNGDEC Memory Control, offset: 0x40 */
       uint8_t RESERVED_2[4];
  __IO uint32_t MIPI_MEM_CTRL;                     /**< MIPI Memory Control, offset: 0x48 */
  __IO uint32_t VGPU_MEM_CTRL;                     /**< VGPU Memory Control, offset: 0x4C */
       uint8_t RESERVED_3[128];
  __IO uint32_t EZHV_RSTBASE;                      /**< EZH-V Reset Base, offset: 0xD0 */
  __IO uint32_t EZHV_RSTMTVEC;                     /**< EZH-V MTVEC Reset Value, offset: 0xD4 */
  __IO uint32_t EZHV_RSTSTVEC;                     /**< EZH-V STVEC Reset Value, offset: 0xD8 */
  __IO uint32_t EZHV_VOFFSET_T;                    /**< EZH-V Interrupt Vector Offset, offset: 0xDC */
  __IO uint32_t EZHV2ARM_INT_EN;                   /**< EZH-V To Arm Interrupt Enable, offset: 0xE0 */
  __IO uint32_t EZHV2ARM_INT_CHAN;                 /**< EZH-V Interrupt Channel, offset: 0xE4 */
  __IO uint32_t ARM2EZHV_INT_CTRL;                 /**< Arm To EZH-V Interrupt Control, offset: 0xE8 */
       uint8_t RESERVED_4[68];
  __IO uint32_t MIPI_DSI_CTRL;                     /**< MIPI_DSI Control, offset: 0x130 */
       uint8_t RESERVED_5[332];
  __IO uint32_t MEDIA_AUTOGATE_EN;                 /**< VDD2_MEDIA Auto Gating Enable, offset: 0x280 */
       uint8_t RESERVED_6[652];
  __IO uint32_t USB0_MEM_CTRL;                     /**< USB0 Memory Control, offset: 0x510 */
  __IO uint32_t USB1_MEM_CTRL;                     /**< USB1 Memory Control, offset: 0x514 */
  __IO uint32_t USDHC0_MEM_CTRL;                   /**< uSDHC0 Memory Control, offset: 0x518 */
  __IO uint32_t USDHC1_MEM_CTRL;                   /**< uSDHC1 Memory Control, offset: 0x51C */
       uint8_t RESERVED_7[260];
  __IO uint32_t GPIO_BANK4_CFG;                    /**< PIO4 Configuration, offset: 0x624 */
  __IO uint32_t GPIO_BANK5_CFG;                    /**< PIO5 Configuration, offset: 0x628 */
  __IO uint32_t GPIO_BANK6_CFG;                    /**< PIO6 Configuration, offset: 0x62C */
       uint8_t RESERVED_8[32];
  __IO uint32_t USBPHY0_CLK_ACTIVE;                /**< USBPHY0 CLK Active, offset: 0x650 */
} SYSCON4_Type;

/* ----------------------------------------------------------------------------
   -- SYSCON4 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON4_Register_Masks SYSCON4 Register Masks
 * @{
 */

/*! @name MMU2_MEM_CTRL - MMU2 Memory Control */
/*! @{ */

#define SYSCON4_MMU2_MEM_CTRL_MEM_STDBY_MASK     (0x80U)
#define SYSCON4_MMU2_MEM_CTRL_MEM_STDBY_SHIFT    (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_MMU2_MEM_CTRL_MEM_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON4_MMU2_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON4_MMU2_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON4_MMU2_MEM_CTRL_MEM_IG_MASK        (0x100U)
#define SYSCON4_MMU2_MEM_CTRL_MEM_IG_SHIFT       (8U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_MMU2_MEM_CTRL_MEM_IG(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON4_MMU2_MEM_CTRL_MEM_IG_SHIFT)) & SYSCON4_MMU2_MEM_CTRL_MEM_IG_MASK)
/*! @} */

/*! @name XSPI2_MEM_CTRL - XSPI2 Memory Control */
/*! @{ */

